---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemIsReference
source: html/ca047a25-7239-83a6-e34a-18210b20fe67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemIsReference Property

"Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemIsReference { get; }
```